; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v9)
             (pred_3 ?v11 ?v8)
             (pred_6 ?v1 ?v8)
             (pred_1 ?v6 ?v1 )
	     (pred_11 ?v1)
             (pred_4 ?v12)
             (pred_8 ?v11)
             (pred_7 ?v8)
             (pred_9 ?v1)
             (pred_10 ?v11)
             (pred_2 ?v1)
             (pred_12 ))



(:action op_1
:parameters (?v13 ?v5 ?v4 ?v7)
:precondition (and (pred_4 ?v13) (pred_4 ?v5) (pred_8 ?v4) (pred_7 ?v7)
          (pred_5 ?v13 ?v5) (pred_3 ?v4 ?v7)
                   (pred_6 ?v5 ?v7) (pred_11 ?v13) 
                   (pred_9 ?v5) (pred_10 ?v4))
:effect (and  (pred_2 ?v5) (not (pred_9 ?v5))))


(:action op_2
:parameters (?v13 ?v10)
:precondition (and (pred_4 ?v13) (pred_4 ?v10)
               (pred_11 ?v13) (pred_5 ?v13 ?v10) (pred_2 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v13))))

(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_4 ?v13) (pred_8 ?v4) 
                  (pred_11 ?v13) (pred_1 ?v4 ?v13) (pred_12 ))
:effect (and (pred_10 ?v4)
   (not (pred_1 ?v4 ?v13)) (not (pred_12 ))))


(:action op_3
:parameters (?v13 ?v3 ?v2)
:precondition (and (pred_4 ?v13) (pred_8 ?v3) (pred_8 ?v2)
                  (pred_11 ?v13) (pred_10 ?v2) (pred_1 ?v3 ?v13))
:effect (and (pred_10 ?v3) (pred_1 ?v2 ?v13)
        (not (pred_10 ?v2)) (not (pred_1 ?v3 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_4 ?v13) (pred_8 ?v4) 
                  (pred_11 ?v13) (pred_10 ?v4))
:effect (and (pred_12 ) (pred_1 ?v4 ?v13) (not (pred_10 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_03 obj_02 obj_11 obj_10 obj_06 obj_13 obj_08 obj_17 obj_16 obj_04 obj_14 obj_05 obj_01 obj_07 obj_18
    obj_09 obj_19
    obj_15 obj_20
    )

    (:init
       (pred_12)

       (pred_4 obj_12)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_17)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_20)

       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_11)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_02)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_18 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_16)
       (pred_6  obj_18 obj_09)
       (pred_6  obj_16 obj_19)
       (pred_2 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_02)
       (pred_2 obj_11)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_07)

       (pred_3  obj_15 obj_09)
       (pred_3  obj_20 obj_19)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_20 obj_02)
       (pred_11 obj_14)
    )

    (:goal (and
       (pred_1 obj_15 obj_17)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_2 obj_14 obj_08)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_08)
   goals met: 0 of 1
2. (op_2 obj_08 obj_11)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_11)
   goals met: 0 of 1
3. (op_2 obj_11 obj_02)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_02)
   goals met: 0 of 1
4. (op_2 obj_02 obj_03)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_03)
   goals met: 0 of 1
5. (op_2 obj_03 obj_12)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_12)
   goals met: 0 of 1
6. (op_2 obj_12 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_10)
   goals met: 0 of 1
7. (op_5 obj_10 obj_15)
   deleted: (pred_1 obj_15 obj_10) (pred_12)
   added: (pred_10 obj_15)
   goals met: 0 of 1
8. (op_2 obj_10 obj_17)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_17)
   goals met: 0 of 1
9. (op_4 obj_17 obj_15)
   deleted: (pred_10 obj_15)
   added: (pred_12) (pred_1 obj_15 obj_17)
   goals met: 1 of 1
